{
    "gameplayPatterns": [
        {
            "id": 101,
            "name": "System Structure",
            "retention": 0.01,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": 0,
            "triggerRate": 1,
            "desc": "Your game has been developed, at least there will be no changes in the main system and main gameplay. Your system determines the payment and operation model of your game. Its main modules should not change too much, but you can still fine-tune some details without causing a large-scale loss of players.",
            "weight": 1
            },
            {
            "id": 102,
            "name": "PVE",
            "retention": 0.01,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": 0,
            "triggerRate": 1,
            "desc": "Player-environment battle is essential in your game. Players can challenge different dungeons, explore maps, and complete levels. Every battle is carefully designed by you to ensure the player's experience.",
            "weight": 1
            },
            {
            "id": 103,
            "name": "PVP",
            "retention": 0,
            "socialBound": 0,
            "payingRate": 0.01,
            "payingAmount": 0,
            "mood": 0,
            "triggerRate": 1,
            "desc": "Player versus player is also a big part of your game. Your players compete with each other and use combat to inspire each other to hone their skills and become stronger. This is also the fun of your game. Players can participate in one-on-one matches in the Arena or engage in group battles.",
            "weight": 1
            },
            {
            "id": 104,
            "name": "Operation",
            "retention": 0.01,
            "socialBound": 0,
            "payingRate": 0.01,
            "payingAmount": 0,
            "mood": 0,
            "triggerRate": 1,
            "desc": "Your game needs to be continuously operated and updated to bring in revenue and new players. You need to design different in-app purchase payment models, and launch new limited-time activities at each stage to stimulate your players' activity and desire to pay.",
            "weight": 1
            },
            {
            "id": 431,
            "name": "Daily Login Rewards",
            "retention": 0.25,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "People are always changing, and so are your players. It’s hard for you to guarantee that they will always like to play your game. Why not give your players a little more motivation to play your game every day? A simple daily login reward can help your players remember what to do first thing the next day.",
            "weight": 100
            },
            {
            "id": 433,
            "name": "Cumulative Online Rewards",
            "retention": 0.125,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": -15,
            "triggerRate": 1,
            "desc": "How long do you want your players to be online every day? One hour or two? To ensure their online time, it is better to provide them with small periodic rewards to give them some motivation. Players can receive gold coins and potions every time they are online for a while, and finally get a one-time powerful item after two hours.",
            "weight": 150
            },
            {
            "id": 432,
            "name": "Daily Task",
            "retention": 0.125,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "You need your players actually play your game. But your non-repetitive content doesn’t seem to support their long daily play. But as a game designer, you also know that repetitive game content is boring. So why not give them some extra external rewards? For example, the experience of the first dungeon every day is doubled.",
            "weight": 100
            },
            {
            "id": 421,
            "name": "Hard Currency vs. Soft Currency",
            "retention": 0,
            "socialBound": 0,
            "payingRate": 0.2,
            "payingAmount": 0,
            "mood": -15,
            "triggerRate": 1,
            "desc": "To earn money, you need to design a powerful currency that is separated from the in-game currency players earn while playing. All in all, this currency is powerful enough for paid players to gain strength far beyond what free players can get. And let in-game purchases be the primary way to obtain this rare currency.",
            "weight": 150
            },
            {
            "id": 411,
            "name": "PVP Ranking&Bragging",
            "retention": 0,
            "socialBound": 0.125,
            "payingRate": 0.1,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "Losers want to win back, winners want to continue winning. Adding a type of PVP ranking points increases while winning and decreases while losing. Let players matched against opponents based on their recent win rates, everyone will have a win rate about 50%. Your players will keep to play over and over for ranked points.",
            "weight": 100
            },
            {
            "id": 412,
            "name": "Mandatory socializing",
            "retention": 0,
            "socialBound": 0.25,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": -15,
            "triggerRate": 1,
            "desc": "There are many ways you can bind your players into small groups that hate each other. For example, there is a guild war once a week. Create a platform for them to find friends and compete with each other, and they will find the addictive point of your game on their own.",
            "weight": 100
            },
            {
            "id": 402,
            "name": "PVE Grinding",
            "retention": 0.2,
            "socialBound": 0,
            "payingRate": 0,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "How many times do you think your players can play your dungeon without getting bored? one time? three times? Five times at most. Maybe you can play a little trick here to make a rare piece of equipment drop in the dungeon with a very small probability. Your players might even play through it 50 times to get their dream gear.",
            "weight": 150
            },
            {
            "id": 401,
            "name": "PVE Pay-to-SKIP",
            "retention": 0,
            "socialBound": 0,
            "payingRate": 0.3,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 0.99,
            "desc": "If a player couldn't complete a level no matter what, what do you want them to do? Never play again? Probably not. Might as well let them spend a little money to skip or beat the level more easily. They don't give up the game and you get money, the best of both worlds.",
            "weight": 150
            },
            {
            "id": 434,
            "name": "Time-Limited Payment Offer",
            "retention": 0,
            "socialBound": 0,
            "payingRate": 0.5,
            "payingAmount": 0.5,
            "mood": -15,
            "triggerRate": 0.2,
            "desc": "There are always some players who are wavering on making in game purchase. You should really take out the equipment they need most at that time, put it in front of them, put a 20% discount label, and add a one-hour time limit. Some players may be swayed, and may even feel like they made a profit if they bought.",
            "weight": 150
            },
            {
            "id": 422,
            "name": "In-App Advertisements",
            "retention": -0.15,
            "socialBound": 0,
            "payingRate": 0.5,
            "payingAmount": 0.5,
            "mood": -23,
            "triggerRate": -1,
            "desc": "Perhaps most players will not make any in-app purchases until they abandon your game. But that doesn't mean they can't make your game profitable. A common method is to embed ads into your game. This won't break their obsession with playing the game for free, but it will still allow you to earn money from advertisers.",
            "weight": 150
            },
            {
            "id": 403,
            "name": "Energy System",
            "retention": 0.125,
            "socialBound": 0,
            "payingRate": 0.05,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "You don't want your players to play all your content intensely for a week and give up on your game completely. Now, you need an energy system. Players spent energy to play, and they cannot play without energy. They have to spend months completing all your contents now. You can also let them spend money on energy.",
            "weight": 100
            },
            {
            "id": 435,
            "name": "Loot Box",
            "retention": 0,
            "socialBound": 0,
            "payingRate": 0.5,
            "payingAmount": 0.33,
            "mood": -30,
            "triggerRate": 0.33,
            "desc": "A skin selling for $100 may be prohibitive, but what about a loot box with a small chance of winning for just $1? Players can earn their coveted skin, or just a potion. You can let everyone get a few free loot boxes, and those lucky winners will help you convey their good fortune to their friends.",
            "weight": 150
            },
            {
            "id": 436,
            "name": "VIP System",
            "retention": 0.1,
            "socialBound": 0,
            "payingRate": 0.1,
            "payingAmount": 0,
            "mood": -8,
            "triggerRate": 1,
            "desc": "Create some milestones for your whale players' spending. The more money they spend, the more rare props or skins they can get that other players can't get. Also give them some shiny logos to show off to other players. This will make them feel that the money spent is worth, and they will never give up on your game easily.",
            "weight": 100
            }
    ]
}