{
    "playerReviews_Main": [
        {
            "id": 101,
            "positive": 1,
            "comments": "I'm absolutely blown away by this game, it's beyond anything I expected!"
            },
            {
            "id": 102,
            "positive": 1,
            "comments": "This game has taken over my life in the best way possible, I can't put it down!"
            },
            {
            "id": 103,
            "positive": 1,
            "comments": "From the stunning visuals to the engaging gameplay, this game is a masterpiece."
            },
            {
            "id": 104,
            "positive": 1,
            "comments": "I was hooked from the very first moment, this game is something special."
            },
            {
            "id": 105,
            "positive": 1,
            "comments": "What an incredible journey this game offers, I'm thoroughly impressed!"
            },
            {
            "id": 106,
            "positive": 1,
            "comments": "The attention to detail in this game is phenomenal, hats off to the developers."
            },
            {
            "id": 107,
            "positive": 1,
            "comments": "I've never been so emotionally invested in a game, it's truly a work of art."
            },
            {
            "id": 108,
            "positive": 1,
            "comments": "Every moment in this game is a delight, I'm so glad I gave it a chance."
            },
            {
            "id": 109,
            "positive": 1,
            "comments": "This game exceeds all my expectations, it's an absolute blast to play."
            },
            {
            "id": 110,
            "positive": 1,
            "comments": "A standing ovation for this game, it's brilliantly executed and wildly entertaining."
            },
            {
            "id": 111,
            "positive": 0,
            "comments": "I really wanted to love this game, but it's been a massive letdown."
            },
            {
            "id": 112,
            "positive": 0,
            "comments": "What a frustrating experience, I regret the time and money spent on this game."
            },
            {
            "id": 113,
            "positive": 0,
            "comments": "I can't believe how underwhelming this game is, it's nothing like what was promised."
            },
            {
            "id": 114,
            "positive": 0,
            "comments": "This game is riddled with bugs and glitches, it's practically unplayable."
            },
            {
            "id": 115,
            "positive": 0,
            "comments": "I've never been so bored playing a game, it's a total snoozefest."
            },
            {
            "id": 116,
            "positive": 0,
            "comments": "The game is a chaotic mess, it's more aggravating than entertaining."
            },
            {
            "id": 117,
            "positive": 0,
            "comments": "So much potential wasted, this game could have been great but it fell flat."
            },
            {
            "id": 118,
            "positive": 0,
            "comments": "I'm utterly disappointed, this game fails to deliver on every level."
            },
            {
            "id": 119,
            "positive": 0,
            "comments": "Save your money, this game is not worth the frustration it brings."
            },
            {
            "id": 120,
            "positive": 0,
            "comments": "An absolute disaster, this game is a textbook example of how not to make a game."
            }
    ]
}